OpenFOAM-v2506/tutorials/lagrangian/kinematicParcelFoam/drippingChair/Allrun-serial
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication blockMesh

runApplication makeFaMesh

# For ids and processor partitioning
runApplication -s volume.serial foamToVTK -name VTK-serial -time 0 \
    -no-finite-area -no-internal -no-lagrangian -no-fields -with-ids \
    -patches filmWalls

runApplication $(getApplication)

if false
then
    # Not usually needed - uses areaWrite
    runApplication -s area.serial foamToVTK -name VTK-serial \
        -no-boundary -no-internal -no-lagrangian
fi

#------------------------------------------------------------------------------
